{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 64, "input_dtype": "float32", "name": "convolution2d_1", "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "b_constraint": null, "nb_col": 1, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "activation": "linear", "batch_input_shape": [null, 1, 2500, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "activation": "linear", "name": "convolution2d_2", "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "b_constraint": null, "nb_col": 1, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [1, 2], "border_mode": "valid", "pool_size": [1, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 512, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_1", "trainable": true, "W_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 5, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_2", "trainable": true, "W_regularizer": null, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}]}